"""----------------------------------------------------------------"""
"""فایل مرتبط با متن ها."""
# استارت پروژع
START ='''سلام %s عزیز به uniland خوش اومدی =) 🍃'''
"""----------------------------------------------------------------"""
# راهنمایی و هلپ
HELP = 'راهنما'
HELP_DESCRIPTION='''سلام. این یک متن مثلا هلپ برای شماست و کابرد دیگه ای نداره. 
امیدوارم زودتر کاملم کنین. 🫶🏻 '''
"""----------------------------------------------------------------"""
FACULTIES = [
    'سرویس',
    'عمومی',
    'علوم کامپیوتر',
    'ریاضی',
    'م.کامپیوتر',
    'برق',
    'مکانیک',
    'صنایع',
    'شیمی',
    'عمران',
    'دریا',
    'پزشکی',
    'معدن',
    'فیزیک',
    'انرژی',
    'مواد و متالوژی',
    'نفت',
    'هوافضا',
    'پلیمر',
    '...'
    ]

YEARS = ['1401','1400','99','98','97','96','95','94','93','92','91','90']

"""----------------------------------------------------------------"""

# TODO!: اسمشون رو به فرمت درست تغییر بدیم. - DONE
# TODO: متن کلید های شیشه ای رو اضافه کنیم. 
JOZVE_TITLE='جزوه و نمونه سوال📚'
JOZVE_DESCRIPTION= 'لطفا اسم استاد، درس و یا سال تحصیلی مورد نظرت رو وارد کن تا برات بفرستمشون. 🦋'
JOZVE_SEARCH = 'جست و جوی جزوه'
JOZVE_SEARCH_DESCRIPTION = 'لطفا نام جزوه رو وارد کنید.'
# TODO: بخش ثبت جزوه رو انجام بده
JOZVE_SABT = 'ثبت جزوه'
JOZVE_SABT_DESCRIPTION = 'لطفا فایل جزوتون رو ارسال کنید.'
JOZVE_SABT_NO = 'نوع فایل:'
JOZVE_SABT_NO_DESCRIPTION = 'لطفا نوع فایل رو انتخاب کنید:'
JOZVE_SABT_NO_JOZVE = 'جزوه'
JOZVE_SABT_NO_NEMONE_SOAL = 'نمونه سوال'
JOZVE_SABT_NO_KHOLASE = 'خلاصه'
JOZVE_SABT_NAME = 'نام درس'
JOZVE_SABT_FACULTY = 'از دانشکده ی '
JOZVE_SABT_WRITER = 'نویسنده'
JOZVE_SABT_YEAR = 'سال'
JOZVE_SABT_OSTAD = 'نام استاد'
JOZVE_SABT_CONFIRM = 'تایید'

JOZVE_DARKHASTI = 'جزوات درخواستی من'
JOZVE_DARKHASTI_DESCRIPTION = 'لطفا نام و مشخصات جزوه درخواستیتون رو وارد کنید تا براتون داخل ربات قرارش بدیم.'
JOZVE_DARKHASTI_CONFIRMATION =  'جزوه مورد نظرتون رو به زودی قرار میدیم.'
"""----------------------------------------------------------------"""
# TODO!: اسمشون رو به فرمت درست تغییر بدیم. - DONE
# TODO: متن کلید های شیشه ای رو اضافه کنیم.
SOURCE = 'منابع'
SOURCE_DESCRIPTION = 'متن توضیح برای منبع'
SOURCE_SABT = 'ثبت منبع'
SOURCE_SABT_DESCRIPTION = 'لطفا فایل منبعتون رو ارسال کنید.'

SOURCE_SEARCH = 'جست و جوی منبع'
SOURCE_SEARCH_DESCRIPTION = 'لطفا نام منبع رو وارد کنید.'

SOURCE_DARKHASTI = 'درخواست منبع'
SOURCE_DARKHASTI_DESCRIPTION = 'لطفا نام و مشخصات منبع درخواستیتون رو وارد کنید تا براتون داخل ربات قرارش بدیم.'
SOURCE_DARKHASTI_CONFIRMATION =  'منبع مورد نظرتون رو به زودی قرار میدیم.'

"""----------------------------------------------------------------"""
RECORDED_CLASSES = 'کلاس های ضبط شده'
RECORDED_DESCRIPTION = 'متن برای کلاس'


RECORDED_SEARCH = 'جست و جوی کلاس'
RECORDED_SEARCH_DESCRIPTION = 'لطفا نام کلاس مورد نظر رو وارد کنید.'

RECORDED_SABT = 'ثبت کلاس'
RECORDED_SABT_DESCRIPTION = 'لطفا لینک یا فایل کلاس رو ارسال کنید.'

RECORDED_DARKHASTI = 'درخواست کلاس'
RECORDED_DARKHASTI_DESCRIPTION = 'لطفا نام و مشخصات کلاس درخواستیتون رو وارد کنید تا براتون داخل ربات قرارش بدیم.'
RECORDED_DARKHASTI_CONFIRMATION =  'کلاس مورد نظرتون رو به زودی قرار میدیم.'

"""----------------------------------------------------------------"""
MY_PROFILE = 'پروفایل من'
MY_PROFILE_DESCRIPTION = 'توضیحات پروفایل من'
MY_EMTIYAZ = 'امتیاز های من'
# TODO: بخش مای امتیاز باید کامل و رفع ابهام بشه.
MY_EMTIYAZ_DESCRIPTION = 'سلام. اینجا بخش امتیاز های من هست و باید کاملش کنم.'
MY_SETTINGS = 'تغییر اطلاعات کاربری'
# TODO: بخش تغییر اطلاعات کاربری باید دکمه شیشه ای هاش کامل بشه.
MY_SETTINGS_DESCRIPTIION = 'اینجا بخش اطلاعات کاربری من هست و باید کامل بشه.'
"""----------------------------------------------------------------"""
ERTEBAT = 'ارتباط با ما'
ERTEBAT_DESCRIPTION = 'لطفا پیام مورد نظرتون رو ارسال کنید.'
"""----------------------------------------------------------------"""
COMMING_SOON = 'مرسی از صبرتون. به زودی به ربات اضافه میشه. =)'
"""----------------------------------------------------------------"""
APPLY = 'اپلایی و مهاجرت'
"""----------------------------------------------------------------"""
OSTAD = 'اطلاعات اساتید'
"""----------------------------------------------------------------"""
RESERVE = 'روز فروش غذا'
"""----------------------------------------------------------------"""
CONFIRM = 'تایید'
"""----------------------------------------------------------------"""




BACK = '👈🏻'
BACK_DESCRIPTION = 'برگشت'
"""----------------------------------------------------------------"""
LINKS =  'ارسال لینک جلسات'
LINK_DISC = 'این فایلته'
"""----------------------------------------------------------------"""
OSTAD_TITLE= 'اطلاعات استاد 👤'
OSTAD_DESCRIPTION= 'لطفا اسم استاد رو وارد کن تا اطلاعات مرتبط بهش مثل ایمیل, تلفن و باقی موارد رو برات بفرستمشون. 🍃'
ERSAL_JOZVE = 'ارسال جزوه ♾'
SETTING = 'تنظیمات⚙️'
ABOUT= 'ارتباط با ما 🙌🏻'
"""----------------------------------------------------------------"""

ADD_JOZVE = 'افزودن جزوه'
ADD_JOZVE_FILE = 'لطفا فایل جزوه رو ارسال کنید.'
ADD_JOZVE_NAME = 'لطفا نام استاد رو ارسال کنید'
ADD_JOZVE_DARS = 'این جزوه برای چه درسی هست؟'
ADD_JOZVE_TERM = 'لطفا سال تدریس جزوه رو ارسال کنید.'
ADD_JOZVE_CONFIRM = 'مرسی از این که بهمون تو بزرگ شدن ربات کمک کردین.\n ما سعی میکنیم به زودی زود فایل ارسالیتون رو بررسی و داخل ربات قرارش بدیم.'
