# Messages to be shown in the project

import enum


class Messages(enum.Enum):

    HELP_MENU = 'راهنمای ثبت و دریافت فایل، جستجو و استفاده از ربات یونیلند\n\n🔹 ایدی ربات:              @UniLandbot\n\n🔹 کانال اطلاع رسانی:  @UniLand_AUT\n\n🔹 پشتیبانی:               @UniLandSupport'

    HELP_MENU_SEARCH = 'نکات مرتبط به بخش جستجو :\n\n🔹 ربات UniLand به شما عزیزان قابلیت دو مدل سرچ را می‌دهد. \n     - سرچ داخل ربات \n     - سرچ اینلاین (داخل چت های pv و گروه و کانال...)\n🔹 در جستجوی خود سعی کنید از کاراکتر "نیم فاصله" استفاده نکنید. (علوم‌‌ریاضی❌، علوم ریاضی✅)\n🔹 برای دستیابی هرچه دقیق تر به اطلاعات مورد نظرتان، نگارش صحیح و دقیق کلمه را رعایت کنید. (امیرگبیر❌، امیرکبیر✅)\n🔹 برای فیلتر نتایج جستجو، از کلمات کلیدی زیر استفاده نمایید:\n  - "اطلاعات": این کلیدواژه، اطلاعات و راه های ارتباطی با اساتید را نمایش می‌دهد.\n  - "جزوه": این کلیدواژه، جزوات و خلاصه نویسی ها و... دروس را نمایش می‌دهد.\n  - "کتاب": این کلیدواژه، کتاب‌ها، منابع، سورس‌ها و... دروس را نمایش می‌دهد.\n  - "تمرینات": این کلیدواژه، تمرینات، نمونه‌سوالات، امتحان‌ها و... دروس را نمایش می‌دهد.\n  - "تمپلیت": این کلیدواژه، تمپلیت‌ها، گزارش دروس آز، پلان‌ها، شیت‌ها و... دروس را نمایش می‌دهد.'

    HELP_MENU_SUBMIT = 'نکات مرتبط به بخش ارسال محتوا:\n\n🔹 در درج اطلاعات مرتبط با فایل ارسالی خود و نگارش کلمات دقت کافی داشته باشید.\n🔹 پس از درج و تکمیل اطلاعات، دکمه "اتمام" را بزنید.\n🔹 در ثبت اطلاعاتی مانند دانشگاه و نام استاد، از کلمات "دانشگاه" و "استاد" استفاده نکنید. (استاد دهقان❌، دهقان✅، دانشگاه صنعتی امیرکبیر❌، صنعتی امیرکبیر✅)\n🔹 فایل های قابل ثبت در ربات در حال حاضر به دو بخش فایل و اطلاعات تقسیم بندی می‌شوند. فایل ها شامل جزوه (جزوه، خلاصه، نت و...)، کتاب (کتاب، سورس، منبع و...)، تمرینات (تمرین، نمونه سوال، امتحانات و ...)، تمپلیت (تمپلیت ها، پلان ها، گزارش کار ها و ...) و ترکیبی از این موارد با هر فرمت دلخواهی (pdf, pptx,  docx, zip, rar and...) می‌باشند؛ اطلاعات نیز درواقع شماره تلفن و ایمیل و راه های ارتباطی با اساتید و دانشکده ها هستند. به زودی قابلیت افزودن کلاس های ضبط شده هم خواهیم داشت.🔥'

    HELP_MENU_SCORES = 'نکات مربوط به امتیازگیری:\n\n🔹 شاید این سوال برایتان پیش آمده باشد که امتیاز هایتان چگونه محاسبه می‌شود؟ امتیاز های شما تعداد لایک (👍) هاییست که کاربران ربات روی فایل های ثبت شده توسط شما اعمال می‌کنند. به عنوان مثال اگر شما ۳ فایل داخل ربات ثبت کرده باشید که به ترتیب ۵، ۷ و ۲ لایک دریافت کرده باشند، امتیاز شما ۵+۷+۲=۱۴ خواهد بود.\n🔹 پس میشه گفت با ثبت محتوای بیشتر می‌تونی شانس امتیازگیری خودتو بالا ببری.\n(آخر هر دوره جدول پر امتیاز ترین کاربر هارو داخل کانالمون منتشر می‌کنیم و جوایزی هم برای نفرات برتر در نظر داریم🔥)'
  
    HELP_MENU_ABOUT_US = 'ساخته شده توسط جمعی از دانشجویان علوم کامپیوتر دانشگاه صنعتی امیرکبیر (پلی‌تکنیک تهران)\n\nایلیا، پوریا، دلارام، علی، فاطمه، محمدرضا، مریم، مهسا'

    HELP_MENU_COMING_SOON = 'منتظر فیچر های جدیدمون باشید 😉\n\n🔹 دسترسی اسان به فرم های آموزشی دانشگاه\n🔹 راهنما و اطلاعات به روز انتخاب واحد هر ترم\n🔹 راهنمای اپلای\n🔹 تعامل و درس خوانی با دانشجو های دیگر\n🔹 ریمایندر\n🔹 دریافت و تبادل روزانه غذای سلف\n🔹 و ...'

  #     ------- MYPROFILE ---------

    MYPROFILE_ACCESS_LEVEL = '🎚️ سطح دسترسی: '

    MYPROFILE_SCORE = '🎰 امتیاز: '

    SUBMISSIONS_COUNT = '📦 تعداد ثبت‌ها: '

    BOOKMARKS_TITLE = '🖇️ تعداد پسندها: '
    BOOKMARKS_NOT_FOUND_TITLE = 'شما هیچ پسندی ندارید!'

  #    ----- MISC -----
    DEFAULT_EMPTY_RESULT_TITLE = 'نتیجه‌ای یافت نشد.'

  #   ------ ADMIN -----
    ACCESS_LEVEL_BY_USERID = 'یوزر آیدی مورد نظر را وارد کنید:\nمی‌توانید یوزر آیدی را وارد کنید و یا یک پیام از شخص مورد نظر فوروارد کنید.'
    ACCESS_LEVEL_CHOOSE = 'سطح دسترسی مد نظر را وارد کنید: \n\n'
    ACCESS_LEVEL_LEVELS = 'عادی: 1 - ادیتور: 2 - ادمین: 3'
    ACCESS_LEVEL_UPDATED = 'سطح دسترسی کاربر با موفقیت آپدیت شد. \n\n'

    CONFIRMATION_NO_UNCONFIMRED_FILE = "فایل تایید نشده‌ای یافت نشد."
    CONFIRMATION_FINISH_PREVIOUS_REVIEW = "قبل از دریافت فایل جدید، بررسی فایل قبلی را تکمیل کنید."
    CONFIRMATION_ALREADY_REVIEWED = "این فایل قبلا بررسی شده است."

    CONFIRMATION_REJECTION_HEAD = "❕یکی از ثبت‌های شما رد شده است."
    CONFIRMATION_REJECTION_SUBMISSION = "📑 محتوای ارسالی: "
    CONFIRMATION_REJECTION_REASON = "🚫 دلیل رد شدن: "
